#include <stdio.h>

int main() {
    float x, y, m, c;
    printf("Введіть координати точки A (x, y): ");
    scanf("%f %f", &x, &y);
    
    // Визначення параметрів прямої
    m = (2 - 1) / (1 - 0);  // коефіцієнт нахилу (slope)
    c = 1;                  // точка перетину з осі y (y-intercept)
    
    // Визначення положення точки відносно прямої
    if (y > m * x + c) {
        printf("Точка знаходиться вище за лінію\n");
    } else if (y < m * x + c) {
        printf("Точка знаходиться нижче лінії\n");
    } else {
        printf("Точка знаходиться на лінії\n");
    }
    
    return 0;
}
